"""
1. Основы работы со списками:
Создайте список чисел от 1 до 5. Выведите его на экран. Затем добавьте число 6 в конец списка и выведите обновленный список.
"""
my_number = [1, 2, 3, 4, 5]
print(my_number)
my_number.append(6)
print(my_number)
