'''
3. Методы работы со списками:

Создайте список из нескольких слов. Используйте метод `append` для добавления нового слова в конец списка. Затем используйте метод `remove` для удаления одного из слов. Выведите окончательный список.
'''
random_list = ['Tost', 'Koks', 'Beer']
random_list.append('Rich')
print(random_list)
random_list.remove('Koks')
print(random_list)