'''
10. Списковые методы:

Создайте список из нескольких строк. Используйте метод `sort` для сортировки списка по алфавиту. Выведите отсортированный список.
'''
list_sort = ['Тыква', 'Вода', 'Арбуз', 'Банан']
list_sort.sort()
print(list_sort)

list_sort.sort(reverse=True)
print(list_sort)
