'''
11. Реверс списка:

Создайте список чисел от 1 до 5. Используйте метод `reverse` для изменения порядка элементов в списке. Выведите обновленный список.
'''

list_number = [1, 2, 3, 4, 5]
print(list_number)
list_number.reverse()
print(list_number)
