'''
12.Итерация по строке:

Создайте строку из нескольких символов. Используйте цикл `for`, чтобы вывести каждый символ строки на отдельной строке.
'''

string_for = 'This is MAGIC *_*'
for s in string_for:
    print(s)