'''
2. Индексация:

Создайте список строк, представляющих дни недели. Выведите название среды (элемент с индексом 2).
'''
day_week = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс']
print(day_week[2])