'''
7. Сравнение списков:

Создайте два списка чисел. Сравните их с использованием операторов сравнения (`==`, `!=`, `<`, `>`). Выведите результат сравнения.
'''
one_list_number = [1, 2, 3, 5]
two_list_number = [1, 2, 3, 5]
print(one_list_number == two_list_number)
print(one_list_number != two_list_number)
print(one_list_number < two_list_number)
print(one_list_number > two_list_number)
