'''
9. Объединение списков:

Создайте два списка чисел. Используйте оператор `+` для объединения списков в новый список. Выведите результат.
'''
list1 = [1, 2, 3]
list2 = [1, 2, 3, 4]
list1 += list2
print(list1)
